{
  "articles": [
    {
      "id": 1,
      "title": "NASA Sets Launch Coverage for Artemis Mega Moon Rocket, Spacecraft",
      "image": "https://www.nasa.gov/sites/default/files/styles/full_width/public/thumbnails/image/52291737656_388a8df7b5_o.jpeg?itok=EU9FHkZr",
      "description": "NASA will provide coverage of prelaunch, launch, and postlaunch activities for Artemis I, the first integrated test of NASA’s Orion spacecraft, Space Launch System (SLS) rocket, and the ground systems at the agency’s Kennedy Space Center in Florida. This uncrewed flight test around the Moon will pave the way for a crewed flight test and future human lunar exploration as part of Artemis. The SLS rocket is targeted to launch during a two-hour window that opens at 8:33 a.m. EDT Monday, Aug. 29, from Launch Pad 39B at Kennedy. The rocket and spacecraft arrived at its launch pad Wednesday after the nearly 10-hour, four-mile trek from the Vehicle Assembly Building. A livestream of the rocket and spacecraft at the launch pad currently is available on the NASA Kennedy YouTube channel. Live coverage of events will air on NASA Television, the NASA app, and the agency’s website, with prelaunch events starting Monday, Aug. 22. The launch countdown will begin Saturday, Aug. 27, at 10:23 a.m."
    },
    {
      "id": 2,
      "title": "Join Our Virtual NASA Social to Experience the Launch of the Artemis I Mission",
      "image": "https://www.nasa.gov/sites/default/files/thumbnails/image/51956990663_a7a5cad860_k_0.jpg",
      "description": "Social media users are invited to register to take part in our global virtual NASA Social for the Artemis I launch of NASAs Space Launch System rocket carrying the Orion spacecraft from Space Launch Complex 39B at Kennedy Space Center in Florida. NASA is targeting launch on August 29, 2022 during a two-hour launch window that opens at 8:33 a.m. EDT.  Artemis I will be an uncrewed flight test to send Orion around the Moon and back to Earth over a six-week mission to check out systems before crew fly aboard on Artemis II. Through Artemis missions, NASA will land the first woman and the first person of color on the Moon, paving the way for a long-term lunar presence and serving as a steppingstone to send astronauts to Mars.If your passion is to communicate and engage the world via social media, then this is the event for you! Seize the opportunity to blog, tweet, post or simply share everything about the Artemis mission."
    },
    {
      "id": 3,
      "title": "50 Years Ago, NASA’s Copernicus Set the Bar for Space Astronomy",
      "image": "https://www.nasa.gov/sites/default/files/thumbnails/image/70hc958_banner.jpg",
      "description": "Learning to point and hold an orbiting telescope on a star long enough for the detectors to capture its light proved much more difficult than expected. Satellites designed to study the Sun at the time had a built-in advantage – they targeted the solar system’s brightest object. Copernicus flew with a new inertial reference unit (IRU) developed by the Massachusetts Institute of Technology. Gyroscopes in the IRU sped up the process of acquiring targets, while other systems kept the satellite locked on. In a study of the mission’s first 500 days, one engineer summed it up by noting that the IRU had made flying Copernicus “a boring operation.”In NASA’s early days, astronomers emphasized the need for ultraviolet (UV) studies, which could not be made from the ground, and this became the primary focus of the OAO program. Of four satellites launched, one failed after three days in space, and another never reached orbit at all. OAO 2, launched in 1968 and named Stargazer, provided years of observations, including low-resolution stellar spectra, which spread out wavelengths much like a rainbow to reveal the UV fingerprints of specific molecules and atoms. Copernicus went deeper still, capturing spectra with up to 200 times better detail in some wavelengths."
    }
  ], 

  "bookmarks": [
    {
      "id": 1,
     "articleId": 1
  },
  {
    "id": 2,
   "articleId": 2
}
  ]
}